export const mockCampusCategories = [
  {
    name: '技术族',
    jobs: [
      { 
        id: '1', 
        title: 'CNC巡检员', 
        salary: '5 - 6K/月', 
        type: ['全职','实习'],  
        location: ['中山市大涌镇'], 
        date: '2025-02-04', 
        urgent: false, 
        long_recruitment: false,
        dept: ['CNC制造类'], 
        company: '英诺莱比智能科技有限公司',
        description: [
          '负责每日原材料的来料检验',
          '执行车间现场的日常巡检，确保生产质量',
          '督导现场6S管理工作的落实',
          '完成上级交办的其他工作任务'
        ], 
        requirement: [
          '中专及以上学历，2年以上现场巡检相关工作经验',
          '具备良好的责任心和原则性，能主动跟进并处理质量异常',
          '能看懂机械图纸，熟练使用卡尺、高度尺、千分尺等常用量具',
          '有机械加工相关行业经验者优先考虑'
        ] 
      },
      { 
        id: '2', 
        title: 'CNC编程工程师(零件加工方向)', 
        salary: '10 - 15K/月', 
        type: ['全职'], 
        location:['中山市大涌镇','中山市火炬开发区'],
        date: '2025-02-06', 
        urgent: false, 
        long_recruitment: true,
        dept: ['CNC制造类'], 
        company: '英诺莱比精密制造有限公司',
        description: [
          '负责零件加工程序的编制，确保合理、安全、高效运行，并持续优化工艺流程',
          '评估编程效率及现场加工时间，提升整体生产效能',
          '推动成本控制及前期工艺策略的持续改进',
          '维护负责区域内的6S现场管理',
          '完成上级安排的其他相关工作'
        ], 
        requirement: [
          '5年以上五金零件或手板模型加工经验，能独立解决加工过程中的技术问题，具备良好的沟通能力、学习能力和团队协作能力',
          '熟悉非标零件（钢、铜、铝等）的小批量编程，具有4轴或3+2轴编程经验者优先',
          '熟悉各类刀具，并能根据现场设备参数合理匹配使用',
          '熟悉不同材料特性，能够针对性选择刀具与编程参数'
        ] 
      },
      { 
        id: '3', 
        title: 'CNC技术员', 
        salary: '8 - 10K/月', 
        type: ['全职','实习'], 
        location: ['中山市大涌镇','中山市火炬开发区'], 
        date: '2025-02-02', 
        urgent: false, 
        long_recruitment: true,
        dept: ['CNC制造类'], 
        company: '英诺莱比精密制造有限公司',
        description: [
          '按照作业指导书与生产计划要求，完成加工任务',
          '监控和优化加工过程，及时排查并处理异常问题',
          '实施数控设备的日常保养与维护',
          '维护责任区域的6S现场管理',
          '执行上级交办的其他任务'
        ], 
        requirement: [
          '3年以上精密零件打样经验，具备4轴或3+2调机经验者优先',
          '熟悉至少两种数控系统（如三菱、新代、兄弟、法兰克等）',
          '能独立完成调试，解决加工中的常见技术问题，确保产品质量与加工安全'
        ] 
      },
      { 
        id: '4', 
        title: '数控车床技术员', 
        salary: '8 - 12K/月', 
        type: ['全职','实习'], 
        location: ['中山市大涌镇','中山市火炬开发区'], 
        date: '2025-02-03', 
        urgent: false, 
        long_recruitment: true,
        dept: ['CNC制造类'], 
        company: '英诺莱比精密制造有限公司',
        description: [
          '根据作业指导书及生产计划，独立完成编程与加工任务',
          '按要求进行自检并记录，规范执行产品标识及过程记录',
          '执行设备的日常保养与维护',
          '落实责任范围内的6S管理',
          '配合完成上级安排的其他工作'
        ], 
        requirement: [
          '能熟练阅读图纸，掌握刀塔机、排刀机操作及车削编程，具备车铣复合经验者优先',
          '熟悉各类车削与铣削工艺，能够加工各类螺纹、滚花、精孔、精轴等结构',
          '能熟练使用各类精密量具，具备良好的品质意识与自检能力',
          '能独立处理加工过程中的常见问题及设备故障，并进行基础维护保养'
        ] 
      },
      // { 
      //   id: '4', 
      //   title: 'CNC巡检员', 
      //   salary: '5 - 6K/月', 
      //   type: ['全职','实习'],  
      //   location: ['中山市大涌镇'], 
      //   date: '2025-02-04', 
      //   urgent: false, 
      //   long_recruitment: false,
      //   dept: ['CNC制造类'], 
      //   company: '英诺莱比智能科技有限公司',
      //   description: [
      //     '负责每日原材料的来料检验',
      //     '执行车间现场的日常巡检，确保生产质量',
      //     '督导现场6S管理工作的落实',
      //     '完成上级交办的其他工作任务'
      //   ], 
      //   requirement: [
      //     '中专及以上学历，2年以上现场巡检相关工作经验',
      //     '具备良好的责任心和原则性，能主动跟进并处理质量异常',
      //     '能看懂机械图纸，熟练使用卡尺、高度尺、千分尺等常用量具',
      //     '有机械加工相关行业经验者优先考虑'
      //   ] 
      // },
      { 
        id: '5', 
        title: '后处理拉丝/研磨技术员', 
        salary: '6 - 8K/月', 
        type: ['全职'], 
        location: ['中山市大涌镇'], 
        date: '2025-02-05', 
        urgent: false, 
        long_recruitment: false,
        dept: ['CNC制造类'], 
        company: '英诺莱比智能科技有限公司',
        description: [
          '从事金属零件的拉丝、研磨、流体抛光等表面处理工作',
          '进行激光打标操作',
          '完成上级交办的其他任务'
        ], 
        requirement: [
          '具备1年以上金属表面处理相关经验',
          '熟悉铝合金零件的加工工艺和处理方法，能够熟练操作相关设备'
        ] 
      },      
      { 
        id: '6', 
        title: '产品清洗员', 
        salary: '5 - 6K/月', 
        type: ['全职','实习'], 
        location: ['中山市大涌镇'], 
        date: '2025-02-09', 
        urgent: false, 
        long_recruitment: false,
        dept: ['CNC制造类'], 
        company: '英诺莱比智能科技有限公司',
        description: [
          '负责产品的超声波清洗作业',
          '使用洗洁精进行产品除油及手工清洗',
          '负责车间区域的6S管理与维护',
          '完成上级安排的其他临时性工作任务'
        ], 
        requirement: [
          '身体健康，能适应两班倒工作安排',
          '做事认真、细心，责任心强',
          '具备良好的服从意识，能积极配合上级工作安排'
        ] 
      },
      { 
        id: '7', 
        title: '技术学徒', 
        salary: '4 - 5K/月', 
        type: ['全职','实习'], 
        location: ['中山市大涌镇'], 
        date: '2025-02-10', 
        urgent: false, 
        long_recruitment: false,
        dept: ['CNC制造类','复模制造类'], 
        company: '英诺莱比智能科技有限公司',
        description: [
          '按照车间生产安排，按时按量完成生产任务，严格遵循工艺流程进行操作',
          '完成上级交办的其他临时性工作'
        ], 
        requirement: [
          '有相关制造或加工经验者优先',
          '学习能力强，积极主动，工作认真负责，具备良好的团队合作精神'
        ] 
      },
      { 
        id: '8', 
        title: '实习工程师', 
        salary: '4 - 5K/月', 
        type: ['全职','实习'], 
        location: ['中山市大涌镇'], 
        date: '2025-02-11', 
        urgent: false, 
        long_recruitment: false,
        dept: ['工程技术类'], 
        company: '英诺莱比智能科技有限公司',
        description: [
          '审核2D/3D图纸，进行项目验证评估、询价报价及DFM报告撰写',
          '编制并发放工艺流程卡，跟进项目进度，协助处理项目问题点',
          '参与2D/3D设计制图、CAM编程及VT模拟',
          '调试三轴、四轴、五轴CNC设备，进行项目验证与优化',
          '完成上级安排的其他工作任务'
        ], 
        requirement: [
          '中专及以上学历，机械类相关专业，可接受在校实习生',
          '熟练使用办公软件，具备基本文档编辑与整理能力',
          '思维清晰，具备良好的沟通能力，工作认真积极，有责任心'
        ] 
      },
      { 
        id: '9', 
        title: '外观质检员', 
        salary: '4 - 5K/月', 
        type: ['全职'], 
        location: ['中山市大涌镇'], 
        date: '2025-02-12', 
        urgent: false, 
        long_recruitment: false,
        dept: ['品质类'], 
        company: '英诺莱比智能科技有限公司',
        description: [
          '负责半成品及成品的目视外观检验，确保产品外观符合客户要求',
          '熟悉外观检验标准和抽样方法，能及时识别并记录外观不良，分类反馈问题并跟进返工处理',
          '负责不合格品的标识、记录、评估、隔离与处置',
          '完成上级安排的其他临时工作'
        ], 
        requirement: [
          '视力良好，工作认真细致，责任心强',
          '熟练操作电脑及办公软件者优先'
        ] 
      },
    
      { 
        id: '10', 
        title: '注塑模具普工', 
        salary: '4 - 5K/月', 
        type: ['全职','实习'], 
        location: ['中山市大涌镇'], 
        date: '2025-02-16', 
        urgent: false, 
        long_recruitment: false,
        dept: ['注塑模具类'], 
        company: '英诺莱比智能科技有限公司',
        description: [
          '按照操作规程操作注塑机，进行注塑产品的检验，生产加工，包装等',
          '监控注塑机的运行状态，及时发现并处理设备异常情况',
          '确保生产过程中的安全，遵守各项安全规定',
          '对生产出的产品进行自检，确保产品无明显缺陷',
          '配合质检人员进行产品质量检验，对不合格产品进行标识和隔离',
          '及时反馈质量问题，协助解决质量隐患',
          '准确填写生产报表和记录，包括生产数量、质量情况、设备运行状态等，确保生产记录报表的真实性和完整性',
          '上级临时安排的其它工作'
        ], 
        requirement: [
          '有注塑行业工作经验者优先',
          '能够快速掌握注塑机的操作方法',
          '具备基本的质量检验能力'
        ] 
      },
      { 
        id: '11', 
        title: '复模后处理技术员', 
        salary: '4 - 6K/月', 
        type: ['全职','实习'], 
        location: ['中山市大涌镇'], 
        date: '2025-02-17', 
        urgent: false, 
        long_recruitment: false,
        dept: ['复模制造类'], 
        company: '英诺莱比智能科技有限公司',
        description: [
          '负责复模产品的后处理工作，包括去披锋、打磨抛光、喷砂、钻孔、装配、粘接、攻牙、喷灰等操作',
          '完成上级交办的其他任务'
        ], 
        requirement: [
          '具备1年以上相关岗位工作经验',
          '能够看懂简单的2D/3D图纸，熟练使用卡尺、高度尺等基础测量工具'
        ] 
      },
      
    ]
  },
  {
    name: '职能族',
    jobs: [
    ]
  }
]; 